{
  "language": "en",
  "dark_mode": "Dark mode",
  "home_welcome": "Hi there",
  "home_i": "i'm Diego Rios",
  "home_what_i_do": "always learning something new",
  "home_job": "FULL STACK software developer.",
  "home_location": "Maule Region, Talca, Chile",
  "home_contact_btn": "Get in touch",
  "menu_about": "About",
  "menu_projects": "Contributed projects",
  "menu_projects_text": "View project",
  "menu_experience": "Experience",
  "menu_contact": "Contact",
  "menu_resume": "CV",
  "about_desc": "My name is Diego Ríos I live in Chile and I am a Full Stack Software Developer, I studied Computer Engineering at the Technological University of Chile INACAP and I graduated in 2020. Currently learning about cloud architecture with AWS.",
  "about_desc2": "I am self-taught, I am constantly learning, always looking for new challenges, I like to work in teams 👥, learn different cultures, travel ✈, go trekking, cycling and Karate, learn new languages ​​🌐. I love learning new technologies and sharing my knowledge, since that helps to train others and at the same time train oneself.",
  "about_desc3": "If you are looking to add someone passionate about learning and willing to push their limits to your team, contact me 😄.",
  "about_desc4": "My Tech skills are:",

  "experience_0_job": "Full stack developer",
  "experience_0_overview": "Being part of an agile development team that focuses on building quality software for different clients of the company. Constantly working on the implementation of features that involve working with FrondEnd technologies such as Quasar, Vue, JavaScript, TypeScript and BackEnd technologies such as NodeJS/Express, C#, ASP.NET Core and SQL server and Oracle databases. I emphasize that it supports an internal project in which it is possible to automate the development of the maintainers, which greatly speeds up the coding times of the different projects. It was also possible to implement pipelines to automate deployments with GitLab CI/CD and automated tests with Jest.",
  "experience_0_duration": "Jan 2021 - Present",
  "experience_1_job": "Technical leader and full stack developer",
  "experience_1_overview": "Being part of the development of a scalable vehicle rental system for one of the companies that makes up Grupo Firma, with the main functions of analyzing, estimating, designing and coding the system, which allowed working with Front End technologies such as HTML, CSS, JavaScript , jQuery, PHP, Codeigniter, Angular and Back End technologies such as Node.js/Express, using Mysql database with ORM Sequelize. Applying good practices and architecture patterns such as DDD and that facilitate the reuse and maintenance of the system. It was possible to automate the tests with Jest/Supertest and the deployment of the systems with GitHub actions. I was also a Technical Leader in charge of proposing improvements and leading the development team for system maintenance.",
  "experience_1_duration": "August 2020 - May 2021",

  "projects_1_overview": "System that manages users, profiles, menu, permissions and event log",
  "projects_1_extended_overview": "building...",
  "projects_2_overview": "Real-time monitoring project for public transport",
  "projects_2_extended_overview": "building...",
  "projects_3_overview": "Vehicle rental system for Rent a Car company",
  "projects_3_extended_overview": "building...",
  "projects_4_overview": "Planning system for company PF",
  "projects_4_extended_overview": "building...",
  "projects_5_overview": "CMPC company order planning system",
  "projects_5_extended_overview": "building...",
  "projects_6_overview": "Manageable website for talita-cumi academy",
  "projects_6_extended_overview": "building...",

  "contact_full_name": "Full name",
  "contact_email": "E-mail adress",
  "contact_message": "Message",
  "contact_btn": "Send message",
  "contact_error_full_name": "Name is required",
  "contact_error_email": "Email adress is required",
  "contact_error_email_validate": "Email adress is not valid",
  "contact_error_message": "Message is required",
  "contact_response_message": "Your message has been successfully sent, i'll reply as soon as possible."
}
