{
  "language": "es",
  "dark_mode": "Modo oscuro",
  "home_welcome": "Hola",
  "home_i": "Soy Diego Rios",
  "home_what_i_do": "Siempre aprendiendo algo nuevo",
  "home_job": "Desarrollador de software FULL STACK.",
  "home_location": "Región del Maule, Talca, Chile",
  "home_contact_btn": "Ponerse en contacto",
  "menu_about": "Sobre mi",
  "menu_projects": "Proyectos",
  "menu_projects_text": "Ver Proyecto",
  "menu_experience": "Experiencia",
  "menu_contact": "Contacto",
  "menu_resume": "CV",
  "about_desc": "Soy Diego Rios vivo en chile y soy Desarrollador de software Full Stack. Soy autodidacta, estoy constantemente aprendiendo , siempre buscando nuevos desafíos, me gusta trabajar en equipos 👥, aprender distintas culturas, viajar ✈ y aprender nuevos idiomas 🌐. Me encanta aprender tecnologías nuevas y compartir mi conocimiento ya que eso ayuda a formar a otros y a la vez formarse uno mismo. Si estas buscando sumar a tu equipo a una persona apasionada por aprender y dispuesta a superar sus limites , contactame 😄. Mis habilidades Tech son:",

  "experience_0_job": "Desarrollador full stack.",
  "experience_0_overview": "Ser parte de un equipo de desarrollo ágil en el cual se enfoca en construir software de calidad a distintos clientes de la empresa. Trabajando constantemente en la implementación de features que implican trabajar con tecnólogas FrondEnd como Quasar, Vue, JavaScript, TypeScript y tecnólogas BackEnd como NodeJS/Express, C#, ASP.NET Core y base de datos SQL server y Oracle. Destaco que apoye en un proyecto interno en el cual se logra automatizar el desarrollo de los mantenedores, lo que agilizo de gran manera los tiempos de codificación de los distintos proyectos. También se logró implementar pipelines para automatizar los despliegues con GitLab CI/CD y test automatizados con Jest.",
  "experience_0_duration": "Junio 2021 - Presente",
  "experience_1_job": "Lider tecnico y desarrollador full stack.",
  "experience_1_overview": "Ser parte del desarrollo de un sistema escalable de renta de vehículos para una de las empresas que compone Grupo firma, con las principales funciones de analizar, estimar, diseñar y codificar el sistema, cuál permitió trabajar con tecnologías Frond End como HTML, CSS, JavaScript, jQuery, PHP, Codeigniter, Angular y tecnólogas Back End como Node.js/Express, ocupando base de datos Mysql con ORM Sequelize. Aplicando buenas prácticas y patrones de arquitectura como DDD y que facilito la reutilización y mantención del sistema. Se logró automatizar los test con Jest/Supertest y el despliegue de los sistemas con GitHub actions. También fui Líder Técnico encargado de proponer mejoras y liderar el equipo de desarrollo destinado a la mantención del sistema",
  "experience_1_duration": "Agosto 2020 - Mayo 2021",

  "projects_1_overview": "Sistema desarrollador como base para diversos proyectos",
  "projects_1_extended_overview": "Tunflix is a streaming website: it allows you to watch movies by scraping data from the internet. The UI is modern and base on material design",
  "projects_2_overview": "Proyecto de seguimiento en tiempo real de transportes públicos",
  "projects_2_extended_overview": "codehub.tn is a showcase website for Code Hub: a coworking space at Sousse for developers",
  "projects_3_overview": "Sistema de arriendos de vehículo para empresa Rent a Car",
  "projects_3_extended_overview": "Burpees.io is a solution for gyms. you can see plannings, take reservations and more. We've developed a white labalise app: If a client wants his native application it will be generated automatically. The dashboard is for the gym owner.",
  "projects_4_overview": "Sistema de planificación para empresa PF",
  "projects_4_extended_overview": "Burpees.io is a solution for gyms. you can see plannings, take reservations and more. We've developed a white labalise app: If a client wants his native application it will be generated automatically. The dashboard is for the gym owner.",
  "projects_5_overview": "Sistema de planificación de pedidos de empresa CMPC",
  "projects_5_extended_overview": "Burpees.io is a solution for gyms. you can see plannings, take reservations and more. We've developed a white labalise app: If a client wants his native application it will be generated automatically. The dashboard is for the gym owner.",
  "projects_6_overview": "Página Web administrable para academia talita-cumi",
  "projects_6_extended_overview": "Burpees.io is a solution for gyms. you can see plannings, take reservations and more. We've developed a white labalise app: If a client wants his native application it will be generated automatically. The dashboard is for the gym owner.",

  "contact_full_name": "nombre completo",
  "contact_email": "Dirección de correo electrónico",
  "contact_message": "Mensaje",
  "contact_btn": "Enviar mensaje",
  "contact_error_full_name": "Se requiere el nombre",
  "contact_error_email": "Se requiere dirección de correo electrónico",
  "contact_error_email_validate": "La dirección de correo electrónico no es válida",
  "contact_error_message": "El mensaje es obligatorio"
}
